MikroElektronika/core_packages/ARM/gcc_clang/def/renesas/R7FA0E3034ZSD/mcu.h
/* =========================================================  IICA0  ========================================================= */
/* =========================================================  IICS0  ========================================================= */
 #define R_IICA0_IICS0_SPD_Pos          (0UL)    /*!< SPD (Bit 0)                                           */
 #define R_IICA0_IICS0_SPD_Msk          (0x1UL)  /*!< SPD (Bitfield-Mask: 0x01)                             */
 #define R_IICA0_IICS0_STD_Pos          (1UL)    /*!< STD (Bit 1)                                           */
 #define R_IICA0_IICS0_STD_Msk          (0x2UL)  /*!< STD (Bitfield-Mask: 0x01)                             */
 #define R_IICA0_IICS0_ACKD_Pos         (2UL)    /*!< ACKD (Bit 2)                                          */
 #define R_IICA0_IICS0_ACKD_Msk         (0x4UL)  /*!< ACKD (Bitfield-Mask: 0x01)                            */
 #define R_IICA0_IICS0_TRC_Pos          (3UL)    /*!< TRC (Bit 3)                                           */
 #define R_IICA0_IICS0_TRC_Msk          (0x8UL)  /*!< TRC (Bitfield-Mask: 0x01)                             */
 #define R_IICA0_IICS0_COI_Pos          (4UL)    /*!< COI (Bit 4)                                           */
 #define R_IICA0_IICS0_COI_Msk          (0x10UL) /*!< COI (Bitfield-Mask: 0x01)                             */
 #define R_IICA0_IICS0_EXC_Pos          (5UL)    /*!< EXC (Bit 5)                                           */
 #define R_IICA0_IICS0_EXC_Msk          (0x20UL) /*!< EXC (Bitfield-Mask: 0x01)                             */
 #define R_IICA0_IICS0_ALD_Pos          (6UL)    /*!< ALD (Bit 6)                                           */
 #define R_IICA0_IICS0_ALD_Msk          (0x40UL) /*!< ALD (Bitfield-Mask: 0x01)                             */
 #define R_IICA0_IICS0_MSTS_Pos         (7UL)    /*!< MSTS (Bit 7)                                          */
 #define R_IICA0_IICS0_MSTS_Msk         (0x80UL) /*!< MSTS (Bitfield-Mask: 0x01)                            */
/* =========================================================  IICF0  ========================================================= */
 #define R_IICA0_IICF0_IICRSV_Pos       (0UL)    /*!< IICRSV (Bit 0)                                        */
 #define R_IICA0_IICF0_IICRSV_Msk       (0x1UL)  /*!< IICRSV (Bitfield-Mask: 0x01)                          */
 #define R_IICA0_IICF0_STCEN_Pos        (1UL)    /*!< STCEN (Bit 1)                                         */
 #define R_IICA0_IICF0_STCEN_Msk        (0x2UL)  /*!< STCEN (Bitfield-Mask: 0x01)                           */
 #define R_IICA0_IICF0_IICBSY_Pos       (6UL)    /*!< IICBSY (Bit 6)                                        */
 #define R_IICA0_IICF0_IICBSY_Msk       (0x40UL) /*!< IICBSY (Bitfield-Mask: 0x01)                          */
 #define R_IICA0_IICF0_STCF_Pos         (7UL)    /*!< STCF (Bit 7)                                          */
 #define R_IICA0_IICF0_STCF_Msk         (0x80UL) /*!< STCF (Bitfield-Mask: 0x01)                            */
/* =======================================================  IICCTL00  ======================================================== */
 #define R_IICA0_IICCTL00_SPT_Pos       (0UL)    /*!< SPT (Bit 0)                                           */
 #define R_IICA0_IICCTL00_SPT_Msk       (0x1UL)  /*!< SPT (Bitfield-Mask: 0x01)                             */
 #define R_IICA0_IICCTL00_STT_Pos       (1UL)    /*!< STT (Bit 1)                                           */
 #define R_IICA0_IICCTL00_STT_Msk       (0x2UL)  /*!< STT (Bitfield-Mask: 0x01)                             */
 #define R_IICA0_IICCTL00_ACKE_Pos      (2UL)    /*!< ACKE (Bit 2)                                          */
 #define R_IICA0_IICCTL00_ACKE_Msk      (0x4UL)  /*!< ACKE (Bitfield-Mask: 0x01)                            */
 #define R_IICA0_IICCTL00_WTIM_Pos      (3UL)    /*!< WTIM (Bit 3)                                          */
 #define R_IICA0_IICCTL00_WTIM_Msk      (0x8UL)  /*!< WTIM (Bitfield-Mask: 0x01)                            */
 #define R_IICA0_IICCTL00_SPIE_Pos      (4UL)    /*!< SPIE (Bit 4)                                          */
 #define R_IICA0_IICCTL00_SPIE_Msk      (0x10UL) /*!< SPIE (Bitfield-Mask: 0x01)                            */
 #define R_IICA0_IICCTL00_WREL_Pos      (5UL)    /*!< WREL (Bit 5)                                          */
 #define R_IICA0_IICCTL00_WREL_Msk      (0x20UL) /*!< WREL (Bitfield-Mask: 0x01)                            */
 #define R_IICA0_IICCTL00_LREL_Pos      (6UL)    /*!< LREL (Bit 6)                                          */
 #define R_IICA0_IICCTL00_LREL_Msk      (0x40UL) /*!< LREL (Bitfield-Mask: 0x01)                            */
 #define R_IICA0_IICCTL00_IICE_Pos      (7UL)    /*!< IICE (Bit 7)                                          */
 #define R_IICA0_IICCTL00_IICE_Msk      (0x80UL) /*!< IICE (Bitfield-Mask: 0x01)                            */
/* =======================================================  IICCTL01  ======================================================== */
 #define R_IICA0_IICCTL01_PRS_Pos       (0UL)    /*!< PRS (Bit 0)                                           */
 #define R_IICA0_IICCTL01_PRS_Msk       (0x1UL)  /*!< PRS (Bitfield-Mask: 0x01)                             */
 #define R_IICA0_IICCTL01_DFC_Pos       (2UL)    /*!< DFC (Bit 2)                                           */
 #define R_IICA0_IICCTL01_DFC_Msk       (0x4UL)  /*!< DFC (Bitfield-Mask: 0x01)                             */
 #define R_IICA0_IICCTL01_SMC_Pos       (3UL)    /*!< SMC (Bit 3)                                           */
 #define R_IICA0_IICCTL01_SMC_Msk       (0x8UL)  /*!< SMC (Bitfield-Mask: 0x01)                             */
 #define R_IICA0_IICCTL01_DAD_Pos       (4UL)    /*!< DAD (Bit 4)                                           */
 #define R_IICA0_IICCTL01_DAD_Msk       (0x10UL) /*!< DAD (Bitfield-Mask: 0x01)                             */
 #define R_IICA0_IICCTL01_CLD_Pos       (5UL)    /*!< CLD (Bit 5)                                           */
 #define R_IICA0_IICCTL01_CLD_Msk       (0x20UL) /*!< CLD (Bitfield-Mask: 0x01)                             */
 #define R_IICA0_IICCTL01_SVADIS_Pos    (6UL)    /*!< SVADIS (Bit 6)                                        */
 #define R_IICA0_IICCTL01_SVADIS_Msk    (0x40UL) /*!< SVADIS (Bitfield-Mask: 0x01)                          */
 #define R_IICA0_IICCTL01_WUP_Pos       (7UL)    /*!< WUP (Bit 7)                                           */
 #define R_IICA0_IICCTL01_WUP_Msk       (0x80UL) /*!< WUP (Bitfield-Mask: 0x01)                             */
/* ========================================================  IICWL0  ========================================================= */
/* ========================================================  IICWH0  ========================================================= */
/* =========================================================  SVA0  ========================================================== */
 #define R_IICA0_SVA0_A_Pos             (1UL)    /*!< A (Bit 1)                                             */
 #define R_IICA0_SVA0_A_Msk             (0xfeUL) /*!< A (Bitfield-Mask: 0x7f)                               */

/* =========================================================================================================================== */
/* ================                                          R_IWDT                                           ================ */
/* =========================================================================================================================== */

/* ========================================================  IWDTRR  ========================================================= */
 #define R_IWDT_IWDTRR_IWDTRR_Pos       (0UL)      /*!< IWDTRR (Bit 0)                                        */
 #define R_IWDT_IWDTRR_IWDTRR_Msk       (0xffUL)   /*!< IWDTRR (Bitfield-Mask: 0xff)                          */
/* ========================================================  IWDTCR  ========================================================= */
 #define R_IWDT_IWDTCR_RPSS_Pos         (12UL)     /*!< RPSS (Bit 12)                                         */
 #define R_IWDT_IWDTCR_RPSS_Msk         (0x3000UL) /*!< RPSS (Bitfield-Mask: 0x03)                            */
 #define R_IWDT_IWDTCR_RPES_Pos         (8UL)      /*!< RPES (Bit 8)                                          */
 #define R_IWDT_IWDTCR_RPES_Msk         (0x300UL)  /*!< RPES (Bitfield-Mask: 0x03)                            */
 #define R_IWDT_IWDTCR_CKS_Pos          (4UL)      /*!< CKS (Bit 4)                                           */
 #define R_IWDT_IWDTCR_CKS_Msk          (0xf0UL)   /*!< CKS (Bitfield-Mask: 0x0f)                             */
 #define R_IWDT_IWDTCR_TOPS_Pos         (0UL)      /*!< TOPS (Bit 0)                                          */
 #define R_IWDT_IWDTCR_TOPS_Msk         (0x3UL)    /*!< TOPS (Bitfield-Mask: 0x03)                            */
/* ========================================================  IWDTSR  ========================================================= */
 #define R_IWDT_IWDTSR_REFEF_Pos        (15UL)     /*!< REFEF (Bit 15)                                        */
 #define R_IWDT_IWDTSR_REFEF_Msk        (0x8000UL) /*!< REFEF (Bitfield-Mask: 0x01)                           */
 #define R_IWDT_IWDTSR_UNDFF_Pos        (14UL)     /*!< UNDFF (Bit 14)                                        */
 #define R_IWDT_IWDTSR_UNDFF_Msk        (0x4000UL) /*!< UNDFF (Bitfield-Mask: 0x01)                           */
 #define R_IWDT_IWDTSR_CNTVAL_Pos       (0UL)      /*!< CNTVAL (Bit 0)                                        */
 #define R_IWDT_IWDTSR_CNTVAL_Msk       (0x3fffUL) /*!< CNTVAL (Bitfield-Mask: 0x3fff)                        */
/* ========================================================  IWDTRCR  ======================================================== */
 #define R_IWDT_IWDTRCR_RSTIRQS_Pos     (7UL)      /*!< RSTIRQS (Bit 7)                                       */
 #define R_IWDT_IWDTRCR_RSTIRQS_Msk     (0x80UL)   /*!< RSTIRQS (Bitfield-Mask: 0x01)                         */
/* =======================================================  IWDTCSTPR  ======================================================= */
 #define R_IWDT_IWDTCSTPR_SLCSTP_Pos    (7UL)      /*!< SLCSTP (Bit 7)                                        */
 #define R_IWDT_IWDTCSTPR_SLCSTP_Msk    (0x80UL)   /*!< SLCSTP (Bitfield-Mask: 0x01)                          */

/* =========================================================================================================================== */
/* ================                                          R_MSTP                                           ================ */
/* =========================================================================================================================== */

/* ========================================================  MSTPCRA  ======================================================== */
 #define R_MSTP_MSTPCRA_MSTPA_Pos        (0UL)      /*!< MSTPA (Bit 0)                                         */
 #define R_MSTP_MSTPCRA_MSTPA_Msk        (0x1UL)    /*!< MSTPA (Bitfield-Mask: 0x01)                           */
/* ========================================================  MSTPCRB  ======================================================== */
 #define R_MSTP_MSTPCRB_MSTPB_Pos        (0UL)      /*!< MSTPB (Bit 0)                                         */
 #define R_MSTP_MSTPCRB_MSTPB_Msk        (0x1UL)    /*!< MSTPB (Bitfield-Mask: 0x01)                           */
/* ========================================================  MSTPCRC  ======================================================== */
 #define R_MSTP_MSTPCRC_MSTPC_Pos        (0UL)      /*!< MSTPC (Bit 0)                                         */
 #define R_MSTP_MSTPCRC_MSTPC_Msk        (0x1UL)    /*!< MSTPC (Bitfield-Mask: 0x01)                           */
/* ========================================================  MSTPCRD  ======================================================== */
 #define R_MSTP_MSTPCRD_MSTPD_Pos        (0UL)      /*!< MSTPD (Bit 0)                                         */
 #define R_MSTP_MSTPCRD_MSTPD_Msk        (0x1UL)    /*!< MSTPD (Bitfield-Mask: 0x01)                           */
/* ========================================================  MSTPCRE  ======================================================== */
 #define R_MSTP_MSTPCRE_MSTPE_Pos        (0UL)      /*!< MSTPE (Bit 0)                                         */
 #define R_MSTP_MSTPCRE_MSTPE_Msk        (0x1UL)    /*!< MSTPE (Bitfield-Mask: 0x01)                           */
/* =======================================================  LSMRWDIS  ======================================================== */
 #define R_MSTP_LSMRWDIS_RTCRWDIS_Pos    (0UL)      /*!< RTCRWDIS (Bit 0)                                      */
 #define R_MSTP_LSMRWDIS_RTCRWDIS_Msk    (0x1UL)    /*!< RTCRWDIS (Bitfield-Mask: 0x01)                        */
 #define R_MSTP_LSMRWDIS_WDTDIS_Pos      (1UL)      /*!< WDTDIS (Bit 1)                                        */
 #define R_MSTP_LSMRWDIS_WDTDIS_Msk      (0x2UL)    /*!< WDTDIS (Bitfield-Mask: 0x01)                          */
 #define R_MSTP_LSMRWDIS_IWDTIDS_Pos     (2UL)      /*!< IWDTIDS (Bit 2)                                       */
 #define R_MSTP_LSMRWDIS_IWDTIDS_Msk     (0x4UL)    /*!< IWDTIDS (Bitfield-Mask: 0x01)                         */
 #define R_MSTP_LSMRWDIS_WREN_Pos        (7UL)      /*!< WREN (Bit 7)                                          */
 #define R_MSTP_LSMRWDIS_WREN_Msk        (0x80UL)   /*!< WREN (Bitfield-Mask: 0x01)                            */
 #define R_MSTP_LSMRWDIS_PRKEY_Pos       (8UL)      /*!< PRKEY (Bit 8)                                         */
 #define R_MSTP_LSMRWDIS_PRKEY_Msk       (0xff00UL) /*!< PRKEY (Bitfield-Mask: 0xff)                           */

/* =========================================================================================================================== */
/* ================                                         R_PCLBUZ                                          ================ */
/* =========================================================================================================================== */

